# PANDAS OPERTATIONS

In [1]:
# Series-->1D
import pandas as pd
import numpy as np

In [2]:
list1=[10,20,30,40]
arr=np.array(list1)
arr

array([10, 20, 30, 40])

In [3]:
#creating DataFrame
pd.Series(data=arr)

0    10
1    20
2    30
3    40
dtype: int32

In [4]:
#changing labels names
labels=['a','b','c','d']
pd.Series(data=list1,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [5]:
#Converting an array into Series
pd.Series(arr,labels)

a    10
b    20
c    30
d    40
dtype: int32

In [6]:
#Converting Dictionery to Series
d={'a':10,'b':20,'c':30}
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

In [7]:
#Series can hold variety of object types
pd.Series(data=labels)

0    a
1    b
2    c
3    d
dtype: object

In [15]:
#DATAFRAMES-->2D
d1={'state':['AP','TS'],'year':[2020,2021]}
df=pd.DataFrame(d1)
df

  state  year
0    AP  2020
1    TS  2021

In [20]:
#Changing row names and here rows are index positions
label=['r1','r2']
df=pd.DataFrame(d1,index=label)
df

   state  year
r1    AP  2020
r2    TS  2021

In [27]:
np.random.seed(10)
df2=pd.DataFrame(np.random.randn(3,3))
df2

          0         1         2
0  1.331587  0.715279 -1.545400
1 -0.008384  0.621336 -0.720086
2  0.265512  0.108549  0.004291

In [28]:
#changing rows and coloums names
np.random.seed(10)
df2=pd.DataFrame(np.random.randn(3,3),index=['r1','r2','r3'],columns=['c1','c2','c3'])
df2

          c1        c2        c3
r1  1.331587  0.715279 -1.545400
r2 -0.008384  0.621336 -0.720086
r3  0.265512  0.108549  0.004291

In [29]:
df2['c1']

r1    1.331587
r2   -0.008384
r3    0.265512
Name: c1, dtype: float64

In [35]:
#adding new column
df2['new']=df2['c1']+df2['c2']
df2

          c1        c2        c3       new
r1  1.331587  0.715279 -1.545400  2.046865
r2 -0.008384  0.621336 -0.720086  0.612952
r3  0.265512  0.108549  0.004291  0.374060

In [36]:
#removingcolumns only this iteration only but present in original set
df2.drop('new',axis=1)

          c1        c2        c3
r1  1.331587  0.715279 -1.545400
r2 -0.008384  0.621336 -0.720086
r3  0.265512  0.108549  0.004291

In [37]:
df2

          c1        c2        c3       new
r1  1.331587  0.715279 -1.545400  2.046865
r2 -0.008384  0.621336 -0.720086  0.612952
r3  0.265512  0.108549  0.004291  0.374060

In [39]:
#removing inthe oringinal set
df2.drop('new',axis=1,inplace=True)
df2

          c1        c2        c3
r1  1.331587  0.715279 -1.545400
r2 -0.008384  0.621336 -0.720086
r3  0.265512  0.108549  0.004291

In [40]:
df2

          c1        c2        c3
r1  1.331587  0.715279 -1.545400
r2 -0.008384  0.621336 -0.720086
r3  0.265512  0.108549  0.004291

In [41]:
#removing rows
df2.drop('r1',axis=0,inplace=True)
df2

          c1        c2        c3
r2 -0.008384  0.621336 -0.720086
r3  0.265512  0.108549  0.004291

In [43]:
#Printing Selected rows and Columns
df2.loc['r2']

c1   -0.008384
c2    0.621336
c3   -0.720086
Name: r2, dtype: float64

In [47]:
df2.loc[:,'c2']

r2    0.621336
r3    0.108549
Name: c2, dtype: float64

In [50]:
#printing index positioned values 1-->r3
a=df2.iloc[1]
b=df2.iloc[:,1]#columns 1-->c2
a

c1    0.265512
c2    0.108549
c3    0.004291
Name: r3, dtype: float64

In [51]:
b

r2    0.621336
r3    0.108549
Name: c2, dtype: float64

In [53]:
df2.iloc[:2,:2]

          c1        c2
r2 -0.008384  0.621336
r3  0.265512  0.108549

In [55]:
#by using column names
df2.loc[:,['c2','c3']]

          c2        c3
r2  0.621336 -0.720086
r3  0.108549  0.004291

In [57]:
#Missing values
df3=pd.DataFrame({'A':[1,2,np.nan],'B':[6,np.nan,np.nan],'c':[1,2,3]})
df3

     A    B  c
0  1.0  6.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [58]:
#testing is there any missing values are present
df3.isna()

       A      B      c
0  False  False  False
1  False   True  False
2   True   True  False

In [59]:
df3.isna().sum()

A    1
B    2
c    0
dtype: int64

In [60]:
#removing missing values by row wise
df3.dropna()

     A    B  c
0  1.0  6.0  1

In [62]:
#removing missing values by coloumn wise
df3.dropna(axis=1)

   c
0  1
1  2
2  3

In [66]:
#Filling empty values using mean or median or mode
df3.fillna(value='mmm')

     A    B  c
0  1.0  6.0  1
1  2.0  mmm  2
2  mmm  mmm  3

In [69]:
#filling with mean
df3['A'].fillna(value=df3['A'].mean(),inplace=True)

In [70]:
df3

     A    B  c
0  1.0  6.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [72]:
df

   state  year
r1    AP  2020
r2    TS  2021

In [73]:
df2

          c1        c2        c3
r2 -0.008384  0.621336 -0.720086
r3  0.265512  0.108549  0.004291

In [74]:
df3

     A    B  c
0  1.0  6.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [85]:
#Group by.
data={'company':['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],'person':['Sam','Charlie','Amy','Vennesha','Curl','Sarah'],'Sales':['200','120','340','114','245','350']}
df4=pd.DataFrame(data)
df4

     company    person Sales
0     Google       Sam   200
1     Google   Charlie   120
2  Microsoft       Amy   340
3  Microsoft  Vennesha   114
4   Facebook      Curl   245
5   Facebook     Sarah   350

In [91]:
df4=pd.DataFrame(data,index=['r1','r2','r3','r4','r5','r6'])
df4

      company    person Sales
r1     Google       Sam   200
r2     Google   Charlie   120
r3  Microsoft       Amy   340
r4  Microsoft  Vennesha   114
r5   Facebook      Curl   245
r6   Facebook     Sarah   350

In [93]:
#grouping with same company names
df4.groupby('company')
df4

      company    person Sales
r1     Google       Sam   200
r2     Google   Charlie   120
r3  Microsoft       Amy   340
r4  Microsoft  Vennesha   114
r5   Facebook      Curl   245
r6   Facebook     Sarah   350

In [94]:
#assigning to variable name
by_comp=df4.groupby('company')
df4

      company    person Sales
r1     Google       Sam   200
r2     Google   Charlie   120
r3  Microsoft       Amy   340
r4  Microsoft  Vennesha   114
r5   Facebook      Curl   245
r6   Facebook     Sarah   350

In [96]:
#mean
by_comp.mean()

C:\Users\user\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3444: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  exec(code_obj, self.user_global_ns, self.user_ns)

              Sales
company
Facebook   122675.0
Google     100060.0
Microsoft  170057.0

In [99]:
#minimum values
by_comp.min()

            person Sales
company
Facebook      Curl   245
Google     Charlie   120
Microsoft      Amy   114

In [100]:
#Combining DataFrames Together
#concatenation-->pd.concat([df1,df2])-->row wise and default
#pd.concat([df1,df2],axis=1)-->coloumn wise

In [145]:
dict1=pd.DataFrame({'c1':[1,2,3,4],
                 'c2':[55,66,55,8],
                 'c3':['a','b','c','d']})
dict1

   c1  c2 c3
0   1  55  a
1   2  66  b
2   3  55  c
3   4   8  d

In [146]:
#top 5 in the dataset
dict1.head()

   c1  c2 c3
0   1  55  a
1   2  66  b
2   3  55  c
3   4   8  d

In [147]:
#Bottom 5 in dataset here it is small dataset with 4 rows then it shows same to both methods
dict1.tail()

   c1  c2 c3
0   1  55  a
1   2  66  b
2   3  55  c
3   4   8  d

In [148]:
#uniq values
dict1['c2'].unique()

array([55, 66,  8], dtype=int64)

In [149]:
#How many unique values are present
dict1['c2'].nunique()

3

In [150]:
dict1['c2'].value_counts()

55    2
66    1
8     1
Name: c2, dtype: int64

In [151]:
#applying the fuctions
dict1['c3'].apply(len)

0    1
1    1
2    1
3    1
Name: c3, dtype: int64

In [152]:
#sum
dict1['c1'].sum()

10

In [153]:
#How many columns
dict1.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [156]:
#how many rows
dict1.index

RangeIndex(start=0, stop=4, step=1)

In [157]:
#deleting the column
del dict1['c3']
dict1

   c1  c2
0   1  55
1   2  66
2   3  55
3   4   8